In [1]:
## PyBank assignment, import panda and read csv file

import pandas as pd
%matplotlib inline

In [85]:
df = pd.read_csv('budget_data.csv')
df.head()

     Date  Profit/Losses
0  Jan-10         867884
1  Feb-10         984655
2  Mar-10         322013
3  Apr-10         -69417
4  May-10         310503

In [84]:
df.head()

     Date  Profit/Losses  difference
0  Jan-10         867884         NaN
1  Feb-10         984655    116771.0
2  Mar-10         322013   -662642.0
3  Apr-10         -69417   -391430.0
4  May-10         310503    379920.0

In [86]:
## Print a summary of top 5 and bottom 5 rows

print (df)

      Date  Profit/Losses
0   Jan-10         867884
1   Feb-10         984655
2   Mar-10         322013
3   Apr-10         -69417
4   May-10         310503
..     ...            ...
81  Oct-16         102685
82  Nov-16         795914
83  Dec-16          60988
84  Jan-17         138230
85  Feb-17         671099

[86 rows x 2 columns]

In [114]:
## Calculate the net total amount of Profit/Losses over the entire period

amount = df['Profit/Losses'].sum()
print ("Total:$", amount)

Total:$ 38382578

In [17]:
## Calculate the total number of months included in the dataset

index = df.index
number_of_rows = len(index)
print(number_of_rows)

86

In [12]:
## Print the total number of months included in the dataset

print ("Total Months:", number_of_rows)

Total Months: 86

In [87]:
## Calculate the average of the changes in Profit/Losses over the entire period.

## create a new column called difference to calculate the change

df['difference'] = df['Profit/Losses'].diff(1)
df.head()

     Date  Profit/Losses  difference
0  Jan-10         867884         NaN
1  Feb-10         984655    116771.0
2  Mar-10         322013   -662642.0
3  Apr-10         -69417   -391430.0
4  May-10         310503    379920.0

In [107]:
## Calculate and Print average change

monthly_change = df['difference'].sum()
denominator = (number_of_rows) - 1
average_change = (monthly_change) / (denominator)
print ("Avg Change:$", average_change)

Avg Change:$ -2315.1176470588234

In [108]:
## Rounding up average change to two decimal places

avg_chg = round(average_change,2)
print(avg_chg)

-2315.12

In [115]:
## Printing Average Change to two decimal places

print ("Average Change:$", avg_chg)

Average Change:$ -2315.12

In [112]:
## Print maximum change - greatest increase - in the difference column

print (df.difference.max())

1926159.0

In [95]:
## Print minimum change - greatest decrease - in the difference column

print (df.difference.min())

-2196167.0

In [74]:
## Sort the difference column in ascending order from lowest to highest

df.sort_values("difference")

      Date  Profit/Losses  difference
44  Sep-13       -1196225  -2196167.0
78  Jul-16       -1163797  -1876758.0
73  Feb-16       -1100387  -1750387.0
31  Aug-12       -1022534  -1529236.0
63  Apr-15        -524626  -1212159.0
..     ...            ...         ...
32  Sep-12         475062   1497596.0
79  Aug-16         569899   1733696.0
47  Dec-13        1150461   1838447.0
25  Feb-12        1170593   1926159.0
0   Jan-10         867884         NaN

[86 rows x 3 columns]

In [116]:
## The sorted values in ascending order - from lowest to highest - in chart above shows the row position in the first column
## The Greatest Decrease (min) is the first row which is row position 44, as per the first column
## Print the greatest decrease in losses (date and amount) over the entire period.

print ("Greatest Decrease in Profits:", df.iloc[44, 0], "($", df.iloc[44, 2], ")")

Greatest Decrease in Profits: Sep-13 ($ -2196167.0 )

In [117]:
## The Greatest Increase (max) is the second last row which is row position 25, as per the first column
## Print the greatest increase in profits (date and amount) over the entire period.

print ("Greatest Increase in Profits:", df.iloc[25, 0],"($", df.iloc[25, 2], ")")

Greatest Increase in Profits: Feb-12 ($ 1926159.0 )